[
  {
    "_id": "65ab56b3978ff91b1c9eb074",
    "name": "aardonyx",
    "weight": "1700kg",
    "height": "2m",
    "length": "8.0m",
    "diet": "herbivore",
    "period": "jurassic",
    "existed": "201.3 - 190.8 million years ago",
    "region": "south africa",
    "type": "terrestrial",
    "description": "Aardonyx (Afrikaans aard, \\\"earth\\\" + Greek onux, \\\"nail, claw\\\") is a genus of basal sauropodomorph dinosaur. It is known from the type species Aardonyx celestae found from the Early Jurassic Elliot Formation of South Africa. A. celestae was named after Celeste Yates, who prepared much of the first known fossil material of the species. It has arm features that are intermediate between prosauropods and sauropods. Based on the structure of the hind limbs and pelvic girdle of Aardonyx, the dinosaur normally moved bipedally but could drop to quadrupedal movement similar to Iguanodon. It shares some attributes with giant quadrupedal sauropods like Apatosaurus.",
    "image": "https://brunosouzadev-dinoapi.s3.sa-east-1.amazonaws.com/images/aardonyx.jpg",
    "isPopular": false,
    "createdAt": "2024-01-20T05:14:27.449Z",
    "updatedAt": "2024-01-20T05:14:27.449Z",
    "__v": 0
  },
  {
    "_id": "65ab5bbf978ff91b1c9eb076",
    "name": "abelisaurus",
    "weight": "3000kg",
    "height": "2m",
    "length": "7.4m",
    "diet": "carnivore",
    "period": "cretaceous",
    "existed": "83.5 - 70.6 million years ago",
    "region": "south america",
    "type": "terrestrial",
    "description": "The large theropod Abelisaurus comahuensis was similar to Albertosaurus from Alberta, Canada especially in it's size and lifestyle. It was a bipedal carnivore that probably reached 7 to 9 meters (25 to 30 feet) in length, although it is known from only one partial skull. But it's skull led two Argentinian paleontologists to put it in it's own family now known as the Abelisaurida. It lived in Argentina during the Late Cretaceous, 70 to 66 million years ago. Coining the type species Abelisaurus comahuensis, both genus and species were named and described by Argentine paleontologists José Bonaparte and Fernando Emilio Novas in 1985. The generic name recognizes Roberto Abel as the discoverer of the type specimen, and also as the former director of the provincial Museum of Cipolletti in Argentina, where the specimen is housed. It also incorporates the Greek σαυρος ('sauros'), meaning 'lizard'. The specific name comahuensis honors the Comahue region of Argentina, where the fossil was found.",
    "image": "https://brunosouzadev-dinoapi.s3.sa-east-1.amazonaws.com/images/abelisaurus.jpg",
    "isPopular": false,
    "createdAt": "2024-01-20T05:35:59.548Z",
    "updatedAt": "2024-01-20T05:35:59.548Z",
    "__v": 0
  },
  {
    "_id": "65ac155886621fdaf2c40bc1",
    "name": "abrictosaurus",
    "weight": "3kg",
    "height": "0.35m",
    "length": "1.2m",
    "diet": "herbivore/omnivore",
    "period": "early jurassic",
    "existed": "199 - 196 million years ago",
    "region": "south africa",
    "type": "terrestrial",
    "description": "This dinosaur is known from the fossil remains of only two individuals, found in the Upper Elliot Formation of Qacha's Nek District in Lesotho and Cape Province in South Africa. Heterodontosaurids like Abrictosaurus were small, early ornithischians, named for their markedly heterodont dentition. They are best known for the large, canine-like tusks (often called caniniforms) in both upper and lower jaws. There were no teeth in the front of the jaws, where a hard beak was used to crop vegetation. There were three premaxillary teeth, with the first two small and conical and the third enlarged to form the upper caniniform, counterpart to the even larger lower caniniform, which was the first dentary tooth. In the upper jaw, a large gap (or diastema) accommodated the lower caniniform tooth and separated the premaxillary teeth from the wider chewing teeth of the maxilla. Similar teeth lined the remainder of the lower jaw. Abrictosaurus is usually considered the most basal member of the family Heterodontosauridae.",
    "image": "https://brunosouzadev-dinoapi.s3.sa-east-1.amazonaws.com/images/abrictosaurus.jpg",
    "isPopular": false,
    "createdAt": "2024-01-20T18:47:52.061Z",
    "updatedAt": "2024-01-20T18:47:52.061Z",
    "__v": 0
  },
  {
    "_id": "65ac183c86621fdaf2c40bc3",
    "name": "abrosaurus",
    "weight": "4500kg",
    "height": "3.2m",
    "length": "9.1m",
    "diet": "herbivore",
    "period": "middle jurassic",
    "existed": "163.5 - 157.3 million years ago",
    "region": "asia",
    "type": "terrestrial",
    "description": "Abrosaurus was discovered in 1984 by Ouyang Hui. Hui first named his find in his 1986 thesis as A. gigantorhinus, or Abrosaurus Gigantorhinus. It's classification has gone under many changes since. The fossils that were found are extremely fragmented, and scientists are still unsure whether this is a separate genus or not. Like most sauropods, Abrosaurus was a quadrupedal herbivore but it was rather small for a sauropod, not much more than 30 feet (9 m) long. Its head was boxy and topped with a tall bony arch containing the nostrils.The generic name meaning 'delicate lizard (from from the Greek αβρος meaning 'delicate' or 'dainty' and σαυρος meaning 'lizard')', refers to the nature of the skull, with large openings separated by thin bony struts. The only named species is now known as A. dongpoi, and is named after eleventh century Chinese poet Su Shi, also known as Su Dongpo, who was born in Sichuan.",
    "image": "https://brunosouzadev-dinoapi.s3.sa-east-1.amazonaws.com/images/abrosaurus.jpg",
    "isPopular": false,
    "createdAt": "2024-01-20T19:00:12.429Z",
    "updatedAt": "2024-01-20T19:00:12.429Z",
    "__v": 0
  },
  {
    "_id": "65ac1ae686621fdaf2c40bc6",
    "name": "abydosaurus",
    "weight": "18000kg",
    "height": "5.48m",
    "length": "18.3m",
    "diet": "herbivore",
    "period": "early cretaceous",
    "existed": "109 - 105.3 million years ago",
    "region": "north america",
    "type": "terrestrial",
    "description": "Abydosaurus was a moderately-sized sauropod dinosaur, a little smaller than Camarasaurus.  It had a high, boxy skull with a protruding snout – perfect for cropping vegetation from the tops of trees. Abydosaurus belongs to the same sauropod group as Camarasaurus, but it is most closely related to another Late Jurassic dinosaur from the Morrison Formation that you might have heard of – Brachiosaurus.  Although their skulls and neck bones are very similar, Abydosaurus had narrower teeth than Brachiosaurus. This allowed it to pack more teeth in its mouth and replace them at a faster rate as they wore out.  Like all dinosaurs and other reptiles, Abydosaurus replaced its teeth many times throughout its life.",
    "image": "https://brunosouzadev-dinoapi.s3.sa-east-1.amazonaws.com/images/abydosaurus.jpg",
    "isPopular": false,
    "createdAt": "2024-01-20T19:11:34.316Z",
    "updatedAt": "2024-01-20T19:11:34.316Z",
    "__v": 0
  },
  {
    "_id": "65ac1d7386621fdaf2c40bc8",
    "name": "acanthopholis",
    "weight": "380kg",
    "height": "1.8m",
    "length": "5.5m",
    "diet": "herbivore",
    "period": "late cretaceous ",
    "existed": "140 - 97 million years ago",
    "region": "europe",
    "type": "terrestrial",
    "description": "Acanthopholis (/ˌækənˈθɒfoʊlɪs/; meaning \"spiny scales\") is a genus of ankylosaurian dinosaur in the family Nodosauridae that lived during the Late Cretaceous Period of England. The armour of Acanthopholis consisted of oval keeled plates set almost horizontally into the skin, with long spikes protruding from the neck and shoulder area, along the spine. Acanthopholis was quadrupedal and herbivorous. Its size has been estimated to be in the range of 3 to 5.5 meters (9.8 to 18.0 ft) long and approximately 380 kilograms (840 lb) in weight.",
    "image": "https://brunosouzadev-dinoapi.s3.sa-east-1.amazonaws.com/images/acanthopholis.jpg",
    "isPopular": false,
    "createdAt": "2024-01-20T19:22:27.787Z",
    "updatedAt": "2024-01-20T19:22:27.787Z",
    "__v": 0
  },
  {
    "_id": "65ac530f4a8084c6a1b20b06",
    "name": "achelousaurus",
    "weight": "3000kg",
    "height": "2.5m",
    "length": "6m",
    "diet": "herbivore",
    "period": "late cretaceous",
    "existed": "74.2 million years ago",
    "region": "north america",
    "type": "terrestrial",
    "description": "Achelousaurus is a genus of centrosaurine ceratopsid dinosaur that lived during the Late Cretaceous Period of what is now North America, about 74.2 million years ago. The first fossils of Achelousaurus were collected in Montana in 1987, by a team led by Jack Horner, with more finds made in 1989. In 1994, Achelousaurus horneri was described and named by Scott D. Sampson; the generic name means \"Achelous lizard\", in reference to the Greek deity Achelous, and the specific name refers to Horner. The genus is known from a few specimens consisting mainly of skull material from individuals, ranging from juveniles to adults. A large centrosaurine, Achelousaurus supposedly was about 6 m (20 ft) long, with a weight of about 3 t (3.3 short tons). As a ceratopsian, it walked on all fours, had a short tail and a large head with a hooked beak. It had a bony neck-frill at the rear of the skull, which sported a pair of long spikes, which curved towards the outside. Adult Achelousaurus had rough bosses (roundish protuberances) above the eyes and on the snout where other centrosaurines often had horns in the same positions. These bosses were covered by a thick layer of keratin, but their exact shape in life is uncertain. Some researchers hypothesize that the bosses were used in fights, with the animals butting each other's heads, as well as for display.",
    "image": "https://brunosouzadev-dinoapi.s3.sa-east-1.amazonaws.com/images/achelousaurus.jpg",
    "isPopular": false,
    "createdAt": "2024-01-20T23:11:11.389Z",
    "updatedAt": "2024-01-20T23:11:11.390Z",
    "__v": 0
  },
  {
    "_id": "65af156b784e13b0a5e697cb",
    "name": "acheroraptor",
    "weight": "30kg",
    "height": "0.8m",
    "length": "3m",
    "diet": "carnivore",
    "period": "late cretaceous",
    "existed": "70.6 - 66 million years ago",
    "region": "north america",
    "type": "terrestrial",
    "description": "Acheroraptor was the first confirmed genus of dromaeosaurid dinosaur to be known as coming from the world famous Hell Creek Formation of North America.‭ ‬Dromaeosaurid teeth had been known before this time,‭ ‬but they had often been presumed to have come from either Dromaeosaurus or Saurornitholestes,‭ ‬though these teeth are now more commonly referred to Acheroraptor.\n\nAt the time of writing Acheroraptor is only known from a maxilla and dentary with additional referred teeth.‭ ‬These however have been enough to at least confirm that Acheroraptor was actually a North American cousin of the famous Velociraptor that lived in Asia.‭ ‬Comparison of the known Acheroraptor fossils at least suggest that the total length of the holotype individual of Acheroraptor would have been somewhere in the region of about two meters in length. Acheroraptor was the only dromaeosaurid dinosaur known from the Hell Creek Formation until‭ ‬2015‭ ‬when the genus Dakotaraptor was named.‭ ‬\n\nAt‭ ‬least five and half meters in length however,‭ ‬Dakotaraptor would have been significantly larger than Acheroraptor.",
    "image": "https://brunosouzadev-dinoapi.s3.sa-east-1.amazonaws.com/images/acheroraptor.jpg",
    "isPopular": false,
    "createdAt": "2024-01-23T01:24:59.418Z",
    "updatedAt": "2024-01-23T01:24:59.418Z",
    "__v": 0
  },
  {
    "_id": "65af191e784e13b0a5e697cd",
    "name": "achillesaurus",
    "weight": "N/A",
    "height": "N/A",
    "length": "0.5-2.5m",
    "diet": "carnivore",
    "period": "late cretaceous",
    "existed": "83.6 million years ago",
    "region": "south america",
    "type": "terrestrial",
    "description": "Achillesaurus manazzonei was a member of the large clade Theropoda and was classified by Martinelli and Vera as a new alvarezsaurid based on the fact that much of the structure of its bones resembled that of Alvarezsaurids. Members of Alvarezsauridae had an insectivorous or carnivorous diet, short forelimbs, and strong breast and arm muscles. These muscles, complete with their bird-like hands, were thought to have facilitated easier digging for insect nests. Alvarezsauridae is considered to be a basal group in Maniraptora, and are thought to have been related to the members of Ornithomimosauria.",
    "image": "https://brunosouzadev-dinoapi.s3.sa-east-1.amazonaws.com/images/achillesaurus.jpg",
    "isPopular": false,
    "createdAt": "2024-01-23T01:40:46.518Z",
    "updatedAt": "2024-01-23T01:40:46.519Z",
    "__v": 0
  },
  {
    "_id": "65af1a8d784e13b0a5e697cf",
    "name": "achillobator ",
    "weight": "350kg",
    "height": "1.8m",
    "length": "6m",
    "diet": "carnivore",
    "period": "late cretaceous",
    "existed": "96 - 89 million years ago",
    "region": "asia",
    "type": "terrestrial",
    "description": "It was a large, heavily-built, ground-dwelling, bipedal carnivore that would have been an active feathered predator hunting with the enlarged sickle claw on each second toe. Measuring around 5 m (16 ft) long and weighing between 250–350 kg (550–770 lb), Achillobator is considered to be one of the largest dromaeosaurs, along with Austroraptor, Dakotaraptor and Utahraptor. Achillobator was a deep-bodied and relatively short-armed dromaeosaurid with stocky and robust legs. Some of the most notable features consisted in the robustly built skeleton—an unusual trait in dromaeosaur dinosaurs, which were generally lightly built animals—such as the deep maxilla and femur, along with the primitive pelvis, having a vertically oriented pubis that differs from most other dromaeosaurids.",
    "image": "https://brunosouzadev-dinoapi.s3.sa-east-1.amazonaws.com/images/achillobator.jpg",
    "isPopular": false,
    "createdAt": "2024-01-23T01:46:53.793Z",
    "updatedAt": "2024-01-23T01:46:53.793Z",
    "__v": 0
  },
  {
    "_id": "65af1cf6784e13b0a5e697d1",
    "name": "acristavus",
    "weight": "1800kg",
    "height": "2m",
    "length": "6.1m",
    "diet": "herbivore",
    "period": "late cretaceous",
    "existed": "70.6 million years ago",
    "region": "north america",
    "type": "terrestrial",
    "description": "The Acristavus gagslarsoni was a species of a hadrosaur that inhabited the continent of North America in the Campanian age of the Late Cretaceous period. The discovery of two specimens of this species has been made so far, one in the Two Medicine Formation in Montana in 1999 and the other in the Wahweap Formation of Utah in 2011. Due to its unique characteristic of not having any cranial ornamentation despite being a hadrosaur, it has been given the name 'non-crested grandfather.' Due to this, it has been thought to be a primitive ancestor of other hadrosaurids such as the Parasaurolophus, Brachylophosaurus, and Maiasaura.",
    "image": "https://brunosouzadev-dinoapi.s3.sa-east-1.amazonaws.com/images/acristavus.jpg",
    "isPopular": false,
    "createdAt": "2024-01-23T01:57:10.633Z",
    "updatedAt": "2024-01-23T01:57:10.633Z",
    "__v": 0
  },
  {
    "_id": "65af1ecc784e13b0a5e697d3",
    "name": "acrocanthosaurus ",
    "weight": "4400–6600 kg",
    "height": "4m",
    "length": "12m",
    "diet": "carnivore",
    "period": "early cretaceous",
    "existed": "113  - 110 million years ago",
    "region": "north america",
    "type": "terrestrial",
    "description": "Acrocanthosaurus was a bipedal predator. As the name suggests, it is best known for the high neural spines on many of its vertebrae, which most likely supported a ridge of muscle over the animal's neck, back, and hips. Acrocanthosaurus was one of the largest theropods, with the largest known specimen reaching 11–11.5 meters (36–38 ft) in length and weighing approximately 4.4–6.6 metric tons (4.9–7.3 short tons). Large theropod footprints discovered in Texas may have been made by Acrocanthosaurus, although there is no direct association with skeletal remains.",
    "image": "https://brunosouzadev-dinoapi.s3.sa-east-1.amazonaws.com/images/acrocanthosaurus.jpg",
    "isPopular": false,
    "createdAt": "2024-01-23T02:05:00.399Z",
    "updatedAt": "2024-01-23T02:05:00.399Z",
    "__v": 0
  },
  {
    "_id": "65af219a784e13b0a5e697d5",
    "name": "acrotholus ",
    "weight": "40kg",
    "height": "N/A",
    "length": "1.8m",
    "diet": "herbivore",
    "period": "84–83.5 million years ago",
    "existed": "late cretaceous",
    "region": "north america",
    "type": "terrestrial",
    "description": "Although so far only represented by skull fragments,‭ ‬Acrotholus was still a very exciting discovery.‭ ‬At the time of its description,‭ ‬Acrotholus was the oldest confirmed pachycephalosaur dinosaur from the North American continent.‭ ‬Also important is that like most other known pachycephalosaurs,‭ ‬Acrotholus already had a fully developed skull dome.‭ ‬However the purpose of this dome is still a controversial matter since the old‭ ‘‬head bashing‭’ ‬theory is not universally accepted by all palaeontologists.‭ ‬It may be that the dome was a purely visual display device for inter species recognition.‭ ‬The bone in the dome of Acrotholus seems to have been over ten centimetres thick.",
    "image": "https://brunosouzadev-dinoapi.s3.sa-east-1.amazonaws.com/images/acrotholus.jpg",
    "isPopular": false,
    "createdAt": "2024-01-23T02:16:58.804Z",
    "updatedAt": "2024-01-23T02:16:58.804Z",
    "__v": 0
  },
  {
    "_id": "65b018ff4e53acf9a2b319fa",
    "name": "adamantisaurus ",
    "weight": "14000kg",
    "height": "4",
    "length": "18",
    "diet": "herbivore",
    "period": "late cretaceous",
    "existed": "83.5 - 66 million years ago",
    "region": "south america",
    "type": "terrestrial",
    "description": "The Adamantisaurus, a titanosaurid sauropod dinosaur, lived during the Late Cretaceous period in what is now southeastern Brazil. Discovered in the Adamantina Formation, this dinosaur is estimated to have been about 18 meters long and 4 meters tall. Weighing around 14 tons, the Adamantisaurus was a herbivore, feeding on vegetation. Its name, meaning \"Adamantina lizard\", honors the location of its discovery and the geologist Sergio Mezzalira, who found the fossils. The fossils, mainly consisting of tail vertebrae, were initially found in 1959 but only formally described in 2006 by paleontologists Rodrigo Santucci and Reinaldo José Bertini. The Adamantisaurus is an important member of the Titanosauria family, which were common in South America during the Cretaceous period.",
    "image": "https://brunosouzadev-dinoapi.s3.sa-east-1.amazonaws.com/images/adamantisaurus.jpg",
    "isPopular": false,
    "createdAt": "2024-01-23T19:52:31.229Z",
    "updatedAt": "2024-01-23T19:52:31.229Z",
    "__v": 0
  },
  {
    "_id": "65b01b5a4e53acf9a2b319fc",
    "name": "adasaurus",
    "weight": "36.4–87kg",
    "height": "1m",
    "length": "3.5m",
    "diet": "carnivore",
    "period": "late cretaceous ",
    "existed": "70 - 68 million years ago",
    "region": "asia",
    "type": "terrestrial",
    "description": "The Adasaurus is a dromaeosaurid theropod dinosaur that lived in the Late Cretaceous period, around 70 to 68 million years ago. It was discovered in the Gobi Desert of Mongolia. Characterized as a small carnivore, it is known for its large, sickle-shaped claw on the second toe of each hind foot. The Adasaurus is estimated to have been about 3 meters (approximately 9.8 feet) long in adulthood. This dinosaur is part of the Dromaeosauridae family, which includes other well-known species like Velociraptor. The available fossils of Adasaurus, primarily consisting of partial skeletons, have provided insights into its physical characteristics and size.",
    "image": "https://brunosouzadev-dinoapi.s3.sa-east-1.amazonaws.com/images/adasaurus.jpg",
    "isPopular": false,
    "createdAt": "2024-01-23T20:02:34.599Z",
    "updatedAt": "2024-01-23T20:02:34.599Z",
    "__v": 0
  },
  {
    "_id": "65b01e124e53acf9a2b319fe",
    "name": "adeopapposaurus ",
    "weight": "3000kg",
    "height": "2.5m",
    "length": "6-9m",
    "diet": "herbivore",
    "period": "early jurassic",
    "existed": "201.3 - 174.1 million years ago",
    "region": "south america",
    "type": "terrestrial",
    "description": "The Adeopapposaurus is a fascinating dinosaur from the Early Jurassic period, predominantly found in Argentina. Belonging to the sauropodomorph group, it was a herbivorous dinosaur characterized by a long, slender neck and a moderately long tail. The Adeopapposaurus measured around 6 to 9 meters in length (approximately 20 to 30 feet) and stood about 2.5 meters tall. Its lightweight structure is indicated by pneumatized vertebrae, and it had a short, wide skull with distinctive fenestrae, suggesting a flexible neck. Although it didn't reach the colossal sizes of its later sauropod relatives, Adeopapposaurus is an important part of understanding early dinosaur evolution in South America.",
    "image": "https://brunosouzadev-dinoapi.s3.sa-east-1.amazonaws.com/images/adeopapposaurus.jpg",
    "isPopular": false,
    "createdAt": "2024-01-23T20:14:10.560Z",
    "updatedAt": "2024-01-23T20:14:10.560Z",
    "__v": 0
  },
  {
    "_id": "65b01fcf4e53acf9a2b31a00",
    "name": "adynomosaurus ",
    "weight": "2300kg",
    "height": "1.79",
    "length": "7.8m",
    "diet": "herbivore",
    "period": "late cretaceous",
    "existed": "70 million years ago",
    "region": "europe",
    "type": "terrestrial",
    "description": "The Adynomosaurus, a Late Cretaceous lambeosaurine dinosaur, was discovered in Catalonia, Spain. It is notable for its uniquely underdeveloped scapula (shoulder bone), suggesting less developed arm muscles compared to other hadrosaurs. Its exact classification within the Lambeosaurinae is uncertain, with some studies suggesting it's a non-hadrosaurid hadrosauroid. Adynomosaurus lived in an environment rich in diverse reptiles and amphibians and was part of a significant faunal turnover in the Late Cretaceous of South-Western Europe.",
    "image": "https://brunosouzadev-dinoapi.s3.sa-east-1.amazonaws.com/images/adynomosaurus.jpg",
    "isPopular": false,
    "createdAt": "2024-01-23T20:21:35.759Z",
    "updatedAt": "2024-01-23T20:21:35.759Z",
    "__v": 0
  },
  {
    "_id": "65b023b04e53acf9a2b31a02",
    "name": "aegyptosaurus",
    "weight": "10500kg",
    "height": "4.9m",
    "length": "15.2m",
    "diet": "herbivore",
    "period": "late cretaceous",
    "existed": "145 - 93.5 million years ago",
    "region": "africa",
    "type": "terrestrial",
    "description": "The Aegyptosaurus, named for its discovery in Egypt, was a herbivorous sauropod from the Late Cretaceous Period, about 95 million years ago. It measured up to 15 meters in length and had a long neck and small skull. Fossils of this dinosaur were found in the Baharîje Formation in Egypt and the Irhazer Shales Formation in Niger. The Aegyptosaurus is an important part of understanding sauropod evolution and the ancient ecosystems of North Africa during the Late Cretaceous.",
    "image": "https://brunosouzadev-dinoapi.s3.sa-east-1.amazonaws.com/images/aegyptosaurus.jpg",
    "isPopular": false,
    "createdAt": "2024-01-23T20:38:08.293Z",
    "updatedAt": "2024-01-23T20:38:08.293Z",
    "__v": 0
  }
]